Table of Contents
 Interface IIdeaPlate
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
An plate is a part of a connection.
public interface IIdeaPlate : IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Geometry
Geometry of the component.
Region2D Geometry { get; }
Property Value
Region2D
 LocalCoordinateSystem
Local Coordinate System (LCS) of the plate. Only vector definition of the LCS is supported, so the instance of CoordSystemByVector must be returned. LCS only effects rotation of the segment, it does not modify on nodes' position.
CoordSystem LocalCoordinateSystem { get; }
Property Value
CoordSystem
 Material
Material of the plate.
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 Origin
Origin node of the plate.
IIdeaNode Origin { get; }
Property Value
IIdeaNode
 Thickness
double Thickness { get; set; }
Property Value
double
 Edit this page